Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: (But only command events, so you can't catch mouse move events in a child control in the parent window in the same way because wxMouseEvent doesn't derive from wxCommandEvent.
ja: (しかし、これが可能なのはコマンドイベントのみです。そのため、同じ方法で子コントロールでのマウス移動イベントを親ウィンドウで捕まえることはできません。なぜなら wxMouseEvent は wxCommandEvent を継承していないためです。

source: (Debug build only.) This variable can be set to a comma-separated list of trace masks used in wxLogTrace calls; wxLog::AddTraceMask is called for every mask in the list during wxWidgets initialization.
ja: (デバッグビルドのみ) この変数は wxLogTrace の呼び出しの中で使用されるトレースマスクのカンマ区切りリストを設定します; wxWidgets の初期化中にリスト内の各マスクに対して wxLog::AddTraceMask が呼ばれます。

source: (In a Unicode build of wxWidgets, the constructor ignores the passed conversion object and retains the Unicode data.)
ja: (Unicode ビルド版の wxWidgets の場合、コンストラクタは引き渡された変換オブジェクトを無視し、Unicode データのまま保持します)

source: (Make sure that the header is not marked as fuzzy.)
ja: (ヘッダが fuzzy としてマーク されない ようにしてください)

source: (Note however that Windows itself has built-in support for surrogate pairs in UTF-16, such as for drawing strings on screen.)
ja: (ただ、画面への文字列の描画など、Windows は元々 UTF-16 のサロゲートペアに対応しています)

source: (Note that even UTF-32 is still not completely trivial as the mapping is different for little and big-endian architectures).
ja: (UTF-32 であっても、リトルエンディアンとビッグエンディアンではバイト列へのマッピングが異なるため、完全に自明とはまだ言えないことに注意してください。)

source: (The macro wxWX2MBbuf reflects the correct return value of cWX2MB (either char* or wxCharBuffer), except for the const.)
ja: (wxWX2MBbuf マクロは const でないことを除いて、cWX2MB の戻り値 (char* または wxCharBuffer) と同じ型になります)

source: (Unix only.) Overrides installation prefix.
ja: (Unix のみ) インストールプレフィックスを上書きします。

source: (notice the absence of c_str(), it is not needed at all with wxWidgets functions)
ja: (c_str() を使用していないことに注目してください。wxWidgets の関数にはそれは必要ありません)

source: (referring to the image, if A->ProcessEvent is called and it doesn't handle the event, B->ProcessEvent will be called and so on...).
ja: (図を参照すると分かるように、A->ProcessEvent でイベントが処理されないと B->ProcessEvent が呼び出され、これが繰り返されます。)

source: (referring to the image, if W->ProcessEvent is called, it immediately calls A->ProcessEvent; if nor A nor B handle the event, then the wxWindow itself is used -- i.e. the dynamically bind event handlers and static event table entries of wxWindow are looked as the last possibility, after all pushed event handlers were tested).
ja: (図を見ると分かるように、W->ProcessEvent が呼ばれるとすぐに A->ProcessEvent を呼び出します; もし A でも B でもイベントを処理しなかった場合、wxWindow 自身が使用されます。つまり、登録されたすべてのイベントハンドラを調べた後にwxWindow の動的イベントハンドラと静的イベントテーブルを調べます。

source: (wxMGL only.) Redirects stderr output to a file.
ja: (wxMGL のみ) 標準エラー出力をファイルへリダイレクトします。

source: (wxMGL only.) Sets MGL video mode.
ja: (wxMGL のみ) MGL ビデオモードを設定します。

source: ... // The constructor initializes the stream buffer and open the file descriptor // associated to the name of the file. wxFileInputStream in_stream("the_file_to_be_read"); // Ok, read some bytes ... nb_datas is expressed in bytes. in_stream.Read(data, nb_datas); if (in_stream.LastError() != wxSTREAM_NOERROR) {
ja: ... // コンストラクタではストリームバッファの初期化と // ファイル名に関連付けられたファイルディスクリプタのオープンが行われる。 wxFileInputStream in_stream("the_file_to_be_read"); // Ok、データを読み込む ... nb_datas はバイト単位で表す。 in_stream.Read(data, nb_datas); if (in_stream.LastError() != wxSTREAM_NOERROR) {

source: ... do something with event.GetPoint() ... } // example of code generating the event: void MyWindow::SendEvent() {
ja: ...event.GetPoint() を使用して処理を行なう... } // イベントを生成するコードの例: void MyWindow::SendEvent() {

source: ... process error ourselves ...
ja: ... 自分自身でエラー処理を行なう ...

source: ... update the frame using the new size ... }
ja: ... 新しいサイズを使用してフレームを更新する ... }

source: ...failure (or we may try iso8859-1/7bit ASCII)... } ...display text...
ja: ...失敗 (iso8859-1/7ビット ASCII を試すかもしれない)... } ...テキストを表示する...

source: // Create a new client
ja: // 新しいクライアントを作成する

source: // Do something.
ja: // 処理を行なう。

source: // For a complete list, look into the documentation at wxStreamBase.
ja: // 完全な一覧は wxStreamBase のドキュメントを参照のこと。

source: // Give it some contents
ja: // 何か値を設定する

source: // Oh oh, something bad happens.
ja: // おっと、何か良くないことが起こった。

source: // Ok, moves to the beginning of the stream.
ja: // Ok、ストリームの先頭へ移動する。

source: // Ok, read some bytes ... nb_datas is expressed in bytes.
ja: // Ok、データを読み込む ... nb_datas はバイト単位で表す。

source: // Send it
ja: // 送信する

source: // The constructor initializes the stream buffer and open the file descriptor
ja: // コンストラクタではストリームバッファの初期化と

source: // What is my current position ?
ja: // 現在位置はどこ?

source: // You can also get the last number of bytes REALLY put into the buffer.
ja: // また、バッファへ実際に書き込んだバイト数を取得することもできる。

source: // You can also inline all like this.
ja: // このようにインラインにすることもできる。

source: // accessors
ja: // アクセサ

source: // an easy and portable way to create a bitmap wxBitmap bmp(wxBITMAP(bmpname)); // which is roughly equivalent to the following #if defined(__WXMSW__) || defined(__WXPM__)
ja: // ビットマップを作成する、簡単で移植性のある方法 wxBitmap bmp(wxBITMAP(bmpname)); // これは以下のコードと大体同じです #if defined(__WXMSW__) || defined(__WXPM__)

source: // associated to the name of the file.
ja: // ファイル名に関連付けられたファイルディスクリプタのオープンが行われる。

source: // code defining event class wxPlotEvent: public wxNotifyEvent { public:
ja: // イベントを定義するコード class wxPlotEvent: public wxNotifyEvent { public:

source: // create text ctrl with minimal size 100x60
ja: // 最小サイズ 100x60 のテキストコントロールを作成する

source: // create text ctrl with minimal size 100x60 that is horizontally and
ja: // 最小サイズ 100x60 のテキストコントロールを作成し、水平方向と

source: // delete all vowels from the string wxString DeleteAllVowels(const wxString& original) {
ja: // 文字列から母音をすべて削除する wxString DeleteAllVowels(const wxString& original) {

source: // do something
ja: //処理を行う

source: // event can be processed either in the base wxWidgets class
ja: // ネイティブコントロールでもイベントを処理するため、

source: // event is not processed anywhere else.
ja: // event.Skip() は呼び出さない。

source: // illegal key hit.
ja: // 対象外のキーが押下された。

source: // in the header of the source file BEGIN_DECLARE_EVENT_TYPES() DECLARE_EVENT_TYPE(name, value) END_DECLARE_EVENT_TYPES() // in the implementation DEFINE_EVENT_TYPE(name)
ja: // ヘッダファイルで使用する BEGIN_DECLARE_EVENT_TYPES() DECLARE_EVENT_TYPE(name, value) END_DECLARE_EVENT_TYPES() // ソースファイルで使用する DEFINE_EVENT_TYPE(name)

source: // in the stream counted from the beginning.
ja: // 最後の位置を返却する。

source: // key code is within legal range.
ja: // キーコードが正しい範囲に入っている。

source: // or the native control.
ja: // event.Skip() を呼び出す。

source: // required for sending with wxPostEvent()
ja: // wxPostEvent() で必要になる

source: // this function converts the input string to uppercase, output it to the screen // and returns the result const char *SayHELLO(const wxString& input) {
ja: // この関数は入力された文字列を大文字に変換し、画面に表示した上で // 結果を返却する const char *SayHELLO(const wxString& input) {

source: // vertically stretchable with a border width of 10
ja: // 垂直方向にリサイズ可能で、ボーダーの太さは 10 にする

source: // we want to get a dialog that is stretchable because it // has a text ctrl at the top and two buttons at the bottom MyDialog::MyDialog(wxFrame *parent, wxWindowID id, const wxString &title )
ja: // 上部にテキストコントロールと下部にふたつのボタンを持つので // リサイズ可能なダイアログにしたい MyDialog::MyDialog(wxFrame *parent, wxWindowID id, const wxString &title )

source: // with an all-around border with a width of 10 and implicit top alignment
ja: // 太さ 10 のボーダーを全方向に持たせ、暗黙的に上揃えにする

source: // wxFile.Open() normally complains if file can't be opened, we don't want it
ja: // 通常はファイルを開けなかった場合に wxFile.Open() がエラーメッセージを出力するが、そうさせたくない

source: // wxFileInputStream will close the file descriptor on destruction.
ja: // wxFileInputStream はデストラクタでファイルディスクリプタを閉じる。

source: //create a sizer with no border and centered horizontally
ja: //サイザーを作成し、ボーダーなしで水平方向に中央揃えにする

source: //create two buttons that are horizontally unstretchable,
ja: //ふたつのボタンを作成し、水平方向にはリサイズ不可にして、

source: 0, // make vertically unstretchable
ja: 0, // 垂直方向にはリサイズ不可にする

source: 0, // make horizontally unstretchable
ja: 0, // 水平方向にはリサイズ不可にする

source: 1, // make vertically stretchable
ja: 1, // 垂直方向にリサイズ可能にする

source: 10 ); // set border width to 10
ja: 10 ); // ボーダーの幅は 10 にする

source: Background: The need for conversion
ja: 背景: 変換に対する要件

source: Data transfer
ja: データの転送

source: Device contexts
ja: デバイスコンテキスト

source: Internationalization Sample - Shows you how all this looks in practice.
ja: 国際化サンプル - 国際化を実際にどういう風に行うのかを示しています。

source: Introduction
ja: イントロダクション

source: Laying out window elements with sizers
ja: サイザーを利用したウィンドウ要素の配置

source: String class: wxString
ja: 文字列クラス: wxString

source: Supported bitmap file formats
ja: 対応しているビットマップファイル形式

source: The idea behind sizers
ja: サイザーの背後にある考え方

source: What is Unicode?
ja: Unicode とは?

source: Writing Non-English Applications - It focuses on handling charsets related problems.
ja: 非英語アプリケーションの作成 - 文字コードに関連した問題について取り組む場合に参照してください。

source: wxApp Overview
ja: wxApp の概要

source: wxBoxSizer can lay out its children either vertically or horizontally, depending on what flag is being used in its constructor.
ja: wxBoxSizer はコンストラクタで使用されたフラグに基づいて、子コントロールを垂直方向または水平方向のいずれかに配置できます。

source: wxCalendarCtrl has native implementation in wxGTK, but it has less features than the generic one.
ja: wxCalendarCtrl は wxGTK でネイティブ実装を持つようになりました。ただし、汎用のものと比べて機能は少ないです。

source: wxClient - This represents the client application, and is used only within a client program.
ja: wxClient - これはクライアントアプリケーションを表しており、クライアントプログラムの中でだけ使用できます。

source: wxConnection - This represents the connection from the client to the server.
ja: wxConnection - これはクライアントからサーバへのコネクションを表しています。

source: wxDialog Overview
ja: wxDialog の概要

source: wxDialog therefore supplies a global wxDialogLayoutAdapter class that implements automatic scrolling adaptation for most sizer-based custom dialogs.
ja: そのために wxDialog ではグローバルな wxDialogLayoutAdapter クラスを提供しており、このクラスではサイザーを利用した大半のダイアログに対して自動スクロール機能を適用させることができます。

source: wxDir is a helper class for enumerating the files or subdirectories of a directory.
ja: wxDir はディレクトリ内のファイル、サブディレクトリを列挙するためのヘルパークラスです。

source: wxFile may be used for low-level IO.
ja: wxFile は低レベル入出力のために使用されます。

source: wxFilterInputStream and wxFileterOutputStream are the base class definitions for stream filtering.
ja: wxFilterInputStream と wxFilterOutputStream はフィルタリング用の基底クラスです。

source: wxFlexGridSizer is a sizer which lays out its children in a two-dimensional table with all table fields in one row having the same height and all fields in one column having the same width, but all rows or all columns are not necessarily the same height or width as in the wxGridSizer.
ja: wxFlexGridSizer は子コントロールを 2 次元の表にレイアウトするサイザーです。同じ行中のセルは同じ高さを持ち、同じ列中のセルは同じ幅を持ちますが、すべての行と列が wxGridSizer のように同じ高さや幅を持つ必要はありません。

source: wxGridBagSizer is a rather special kind of sizer which, unlike the other classes, allows to directly put the elements at the given position in the sizer.
ja: wxGridBagSizer はかなり特殊な種類のサイザーで、他のクラスと異なり、サイザー内の指定した位置に子コントロールを直接配置することができます。

source: wxGridSizer is a sizer which lays out its children in a two-dimensional table with all table fields having the same size, i.e. the width of each field is the width of the widest child, the height of each field is the height of the tallest child.
ja: wxGridSizer は子コントロールを 2 次元の表にレイアウトするサイザーで、表中のセルはすべて同じ大きさを持ちます。つまり、各セルの幅はもっとも幅の広い子コントロールの幅になり、高さはもっとも高い子コントロールの高さになります。

source: wxGridSizer is a two-dimensional sizer.
ja: wxGridSizer は 2 次元のサイザーです。

source: wxIcon icon(wxICON(sample)); // The above line is equivalent to this: #if defined(__WXGTK__) || defined(__WXMOTIF__) wxIcon icon(sample_xpm); #endif #if defined(__WXMSW__) wxIcon icon("sample"); #endif
ja: wxIcon icon(wxICON(sample)); // 上の行はこれと同等: #if defined(__WXGTK__) || defined(__WXMOTIF__) wxIcon icon(sample_xpm); #endif #if defined(__WXMSW__) wxIcon icon("sample"); #endif

source: wxInputStream is the base class for read-only streams.
ja: wxInputStream は読み取り専用ストリームの基底クラスです。

source: wxLog Classes Overview
ja: wxLog クラスの概要

source: wxLogBuffer: This target collects all the logged messages in an internal buffer allowing to show them later to the user all at once.
ja: wxLogBuffer: このターゲットはすべてのログメッセージを内部バッファに収集し、後で一括してユーザに通知できるようにします。

source: wxLogDebug() is the right function for debug output.
ja: wxLogDebug は まさに デバッグ出力に適切な関数です。

source: wxLogError() is the function to use for error messages, i.e. the messages that must be shown to the user.
ja: wxLogError はエラーメッセージ (ユーザに通知しなければならないメッセージ) 用の関数です。

source: wxLogFatalError() which is like wxLogError(), but also terminates the program with the exit code 3 (using abort() standard function).
ja: wxLogFatalError は wxLogError と似ていますが、(abort() 標準関数を使用して) リターンコード 3 でプログラムを終了させます。

source: wxLogGui: This is the standard log target for wxWidgets applications (it is used by default if you don't do anything) and provides the most reasonable handling of all types of messages for given platform.
ja: wxLogGui: これは wxWidgets アプリケーションの標準ログターゲット (何もしない場合にデフォルトで使用されます) で、指定されたプラットフォームについて、メッセージのすべての型に対してもっとも合理的な処理を行います。

source: wxLogMessage() is for all normal, informational messages.
ja: wxLogMessage はすべての通常 (通知) メッセージ用の関数です。

source: wxLogNull: The last log class is quite particular: it doesn't do anything.
ja: wxLogNull: 最後のログクラスは極めて特殊です: これは何も行いません。

source: wxLogStatus() is for status messages.
ja: wxLogStatus() はステータスメッセージ用です。

source: wxLogStderr: This class logs messages to a FILE *, using stderr by default as its name suggests.
ja: wxLogStderr: このクラスはメッセージを FILE * へ出力します。その名の通り、デフォルトでは stderr へ出力します。

source: wxLogStream: This class has the same functionality as wxLogStderr, but uses ostream and cerr instead of FILE * and stderr.
ja: wxLogStream: このクラスは wxLogStderr と同じ機能を持ちますが、FILE * と stderr の代わりに ostream と cerr を使用します。

source: wxLogSysError() is mostly used by wxWidgets itself, but might be handy for logging errors after system call (API function) failure.
ja: wxLogSysError は主に wxWidgets 自身で使用されますが、システムコール (API 関数) の失敗後のエラーログを記録するのに便利かもしれません。

source: wxLogTrace() as wxLogDebug() only does something in debug build.
ja: wxLogTrace も wxLogDebug と同じようにデバッグビルド時のみ動作します。

source: wxLogVerbose() is for verbose output.
ja: wxLogVerbose は詳細な出力用の関数です。

source: wxLogWarning() for warnings.
ja: wxLogWarning() は警告メッセージ用です。

source: wxLogWindow: This log target provides a "log console" which collects all messages generated by the application and also passes them to the previous active log target.
ja: wxLogWindow: このログターゲットはアプリケーションの生成するすべてのメッセージを収集する "ログコンソール" を提供するとともに、前に有効だったログターゲットに収集したメッセージを引き渡します。

source: wxMBConv Overview
ja: wxMBConv の概要

source: wxMessageBox(L"Salut \u00E0 toi!"); // U+00E0 is "Latin Small Letter a with Grave"
ja: wxMessageBox(L"Salut \u00E0 toi!"); // U+00E0 は "グレイヴ付きのラテン小文字の a" です

source: wxNotebook::AddPage: No event-free alternatives
ja: wxNotebook::AddPage: イベントを送信しない代替方法を持たない

source: wxNotebook::AdvanceSelection: No event-free alternatives
ja: wxNotebook::AdvanceSelection: イベントを送信しない代替方法を持たない

source: wxNotebook::DeletePage: No event-free alternatives
ja: wxNotebook::DeletePage: イベントを送信しない代替方法を持たない

source: wxNotebook::SetSelection: Use wxNotebook::ChangeSelection instead, as wxNotebook::SetSelection is deprecated
ja: wxNotebook::SetSelection: wxNotebook::SetSelection は非推奨のため、代わりに wxNotebook::ChangeSelection を使用してください。

source: wxProtocol, wxURL, wxFTP, wxHTTP - Classes for programming popular Internet protocols.
ja: wxProtocol、wxURL、wxFTP、wxHTTP - よく知られているインターネットプロトコルのプログラミング用クラスです。

source: wxProtocol, wxURL, wxFTP, wxHTTP: classes for programming popular Internet protocols.
ja: wxProtocol、wxURL、wxFTP、wxHTTP: よく知られているインターネットプロトコルのプログラミング用クラスです。

source: wxServer - This represents the server application, and is used only within a server program.
ja: wxServer - これはサーバアプリケーションを表しており、サーバプログラムの中でだけ使用できます。

source: wxSizer::Fit(): this sets the size of the window to be large enough to accommodate the minimum size needed by the sizer, (along with a few other constraints...).
ja: wxSizer::Fit(): これは (他のいくつかの制約とあわせて) サイザーの要求する最小サイズを充分満たすようにウィンドウサイズを設定します。

source: wxSizer::Layout(): recalculates the minimum space needed by each item in the sizer, and then lays out the items within the space currently allotted to the sizer.
ja: wxSizer::Layout(): サイザー内の各要素が必要とする最小サイズを再計算し、現在サイザーに割り当てられているスペース内に各要素を配置します。

source: wxSizer, Sizer overview
ja: wxSizer, Sizer の概要

source: wxSocketEvent, wxSocketBase, wxSocketClient, wxSocketServer - Classes for the low-level TCP/IP API.
ja: wxSocketEvent、wxSocketBase、wxSocketClient、wxSocketServer - 低レベルのTCP/IP API 用クラスです。

source: wxSocketEvent, wxSocketBase, wxSocketClient, wxSocketServer: classes for the low-level TCP/IP API.
ja: wxSocketEvent、wxSocketBase、wxSocketClient、wxSocketServer: 低レベルのTCP/IP API 用クラスです。

source: wxStaticBoxSixer is the same as a wxBoxSizer, but surrounded by a static box.
ja: wxStaticBoxSixer は wxBoxSizer と同じですが、スタティックボックスで周りを囲まれます。

source: wxStaticBoxSizer is a sizer derived from wxBoxSizer but adds a static box around the sizer.
ja: wxStaticBoxSizer は wxBoxSizer を継承したサイザーですが、サイザーの周囲にスタティックボックスを追加します。

source: wxStreamBase is the base definition of a stream.
ja: wxStreamBase はストリームの基底クラスです。

source: wxStreamBuffer is a cache manager for wxStreamBase: it manages a stream buffer linked to a stream.
ja: wxStreamBuffer は wxStreamBase 用のキャッシュマネージャです: このクラスはストリームに関連付けられたストリームバッファを管理します。

source: wxString::mb_str() converts the string to the encoding used by the current locale and so can return an empty string if the string contains characters not representable in it as explained in Data Loss due To Unicode Conversion Errors.
ja: wxString::mb_str() は文字列を現在のロケールで使用されているエンコーディングに変換します。そのため、Unicode の変換エラーによるデータ喪失 で述べたように、変換先のエンコーディングで表現できない文字が含まれている場合に空文字列を返却します。

source: wxString API provides implicit conversion of the internal Unicode string contents to narrow, char strings.
ja: wxString API は内部の Unicode 文字列からナロー (char) 文字列への暗黙的な変換を行います。

source: wxString Overview
ja: wxString の概要

source: wxString also provides two convenience functions: wxString::From8BitData() and wxString::To8BitData().
ja: wxString はさらに 2 つの便利な関数を提供しています: wxString::From8BitData() と wxString::To8BitData() です。

source: wxString can be used to store binary data (even if it contains NULs) using the functions wxString::To8BitData and wxString::From8BitData.
ja: wxString::To8BitData 関数と wxString::From8BitData 関数を使用して、wxString にバイナリデータ (NUL を含むこともできます) を格納することができます。

source: wxString is a class which represents a Unicode string of arbitrary length and containing arbitrary Unicode characters.
ja: wxString は任意の長さで、任意の Unicode 文字を含む Unicode 文字列を表すクラスです。

source: wxString server = "4242"; wxString hostName; wxGetHostName(hostName); // Create a new client MyClient *client = new MyClient; connection = (MyConnection *)client->MakeConnection(hostName, server, "IPC TEST"); if (!connection) {
ja: wxString server = "4242"; wxString hostName; wxGetHostName(hostName); // 新しいクライアントを作成する MyClient *client = new MyClient; connection = (MyConnection *)client->MakeConnection(hostName, server, "IPC TEST"); if (!connection) {

source: wxTempFile is a very small file designed to make replacing the files contents safer - see its documentation for more details.
ja: wxTempFile はより安全にファイルの置換を行うためのとても小さなファイルです。詳細はドキュメントを参照してください。

source: wxTextCtrl::ChangeValue can be used instead of wxTextCtrl::SetValue but the other functions, such as Replace or WriteText don't have event-free equivalents
ja: wxTextCtrl::SetValue の代わりに wxTextCtrl::ChangeValue を使用できますが、Replace や WriteText といった他の関数にはイベントを送信せずに同じことを行う関数はありません。

source: wxTextCtrl::ChangeValue can be used instead of wxTextCtrl::SetValue but the other functions, such as wxTextCtrl::Replace or wxTextCtrl::WriteText don't have event-free equivalents.
ja: wxTextCtrl::SetValue の代わりに wxTextCtrl::ChangeValue を使用できますが、wxTextCtrl::Replace や wxTextCtrl::WriteText といった他の関数にはイベントを送信せずに同じことを行う関数はありません。

source: wxTextFile is a general purpose class for working with small text files on line by line basis.
ja: wxTextFile は小さなテキストファイルを行単位で扱うための汎用的なクラスです。

source: wxTreeCtrl::Delete: No event-free alternatives
ja: wxTreeCtrl::Delete: イベントを送信しない代替方法を持たない

source: wxTreeCtrl::DeleteAllItems: No event-free alternatives
ja: wxTreeCtrl::DeleteAllItems: イベントを送信しない代替方法を持たない

source: wxTreeCtrl::EditLabel: No event-free alternatives
ja: wxTreeCtrl::EditLabel: イベントを送信しない代替方法を持たない

source: wxValidator Overview
ja: wxValidator の概要

source: wxWindow::Fit(): this method sets the size of a window to fit around its children.
ja: wxWindow::Fit(): この関数は子コントロールにフィットするようにウィンドウのサイズを設定します。

source: wxWindow::Freeze/Thaw() are not virtual any more, if you overrode them in your code you need to override DoFreeze/Thaw() instead now.
ja: wxWindow::Freeze/Thaw() はもはや仮想関数ではなくなりました。コードの中でそれらをオーバーライドしている場合、代わりに DoFreeze/Thaw() をオーバーライドする必要があります。

source: wxWindow::GetEffectiveMinSize(): returns a blending of the widget's minimal size and best size, giving precedence to the minimal size.
ja: wxWindow::GetEffectiveMinSize(): ウィジェットの最小サイズと最適サイズを混ぜあわせたものを返却します。このサイズは最小サイズよりも優先されます。

source: wxWindow::IsEnabled() now returns false if a window parent (and not necessarily the window itself) is disabled, new function IsThisEnabled() with the same behaviour as old IsEnabled() was added.
ja: wxWindow::IsEnabled() はウィンドウの親 (ウィンドウ自身である必要はありません) が無効化されている場合に false を返却するようになりました。そのため、以前の IsEnabled() と同じ振る舞いをする新しい関数 IsThisEnabled() が追加されました。

source: wxWindow::Layout(): if the window has a sizer then it sets the space given to the sizer to the current size of the window, which results in a call to wxSizer::Layout().
ja: wxWindow::Layout(): ウィンドウがサイザーを持つ場合に、現在のウィンドウサイズにあわせてサイザーが利用可能なスペースを設定します。これにより wxSizer::Layout() が呼び出されます。

source: wxWindow::SetInitialSize(): this is a little different than the typical size setters.
ja: wxWindow::SetInitialSize(): これは通常のサイズ設定関数とは少しだけ異なります。

source: wxWizard uses its own CanDoLayoutAdaptation and DoLayoutAdaptation functions rather than the global adapter: again, only the wizard pages are made scrollable.
ja: wxWizard はグローバルなアダプタではなく、独自の CanDoLayoutAdaptation と DoLayoutAdaptation 関数を使用します。繰り返しになりますが、ウィザードページのみがスクロール可能になります。

source: wxYES_NO // Add Yes/No subpanel wxYES // return wxID_YES wxNO // return wxID_NO wxNO_DEFAULT // make the wxNO button the default,
ja: wxYES_NO // Yes/No サブパネルを追加します wxYES // wxID_YES を返却します wxNO // wxID_NO を返却します wxNO_DEFAULT // wxNO ボタンをデフォルトにします。

source: Conversion between Unicode and multibyte strings
ja: Unicode とマルチバイト文字列間の変換

source: Converting strings
ja: 文字列の変換

source: Event macros summary
ja: イベントマクロの概要

source: Stream classes
ja: ストリームクラス

source: Transferring and validating data
ja: データの転送と検証

source: Tuning wxString for your application
ja: wxString のチューニング

source: wxApp overview
ja: wxApp の概要

source: Converting buffers
ja: バッファの変換

source: Custom event summary
ja: カスタムイベントの概要

source: Internationalization
ja: 国際化

source: Multi-threaded applications
ja: マルチスレッドアプリケーション

source: wxString text = event.GetString(); } // example of code handling the event with Bind<>(): MyFrame::MyFrame() {
ja: wxString text = event.GetString(); } // Bind<>() によるイベント処理のコード例: MyFrame::MyFrame() {

source: Multithreading overview
ja: マルチスレッドの概要

source: Drag and drop overview
ja: ドラッグ・アンド・ドロップの概要

source: Drag and drop
ja: ドラッグ・アンド・ドロップ

source: Working with program options: wxConfig
ja: プログラムオプションの使用: wxConfig

source: Writing non-English applications
ja: 非英語アプリケーションの作成

source: Interprocess communication overview
ja: プロセス間通信の概要

source: Environment variables
ja: 環境変数

source: Logging overview
ja: ロギングの概要

source: wxInputStream and wxOutputStream classes inherit from wxStreamBase and provide specialized methods for input and output.
ja: wxInputStream クラスと wxOutputStream クラスは wxStreamBase を継承しており、入出力に関する専用の関数を提供します。
